figures/shRNAseq_pipeline.nf.dot
digraph "shRNAseq_pipelinenf" {
p0 [shape=point,label="",fixedsize=true,width=0.1,xlabel="Channel.fromFilePairs"];
p7 [label="trim_readsPE"];
p0 -> p7 [label="read_pairs"];

p1 [shape=point,label="",fixedsize=true,width=0.1,xlabel="Channel.fromPath"];
p21 [label="fastqc"];
p1 -> p21 [label="fastqr1_ch2"];

p2 [shape=point,label="",fixedsize=true,width=0.1,xlabel="Channel.fromPath"];
p3 [label="idx"];
p2 -> p3 [label="fa_ch"];

p3 [label="idx"];
p4 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="flatten"];
p3 -> p4 [label="idx_bowtie_ch"];

p4 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="flatten"];
p5 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
p4 -> p5;

p5 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
p6 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="map"];
p5 -> p6;

p6 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="map"];
p10 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="combine"];
p6 -> p10 [label="idx_bowtie_ch"];

p7 [label="trim_readsPE"];
p10 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="combine"];
p7 -> p10 [label="map_readsPE_ch"];

p7 [label="trim_readsPE"];
p9 [shape=point];
p7 -> p9;

p7 [label="trim_readsPE"];
p8 [shape=point];
p7 -> p8;

p10 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="combine"];
p11 [label="mapPE"];
p10 -> p11 [label="map_readsPE_ch"];

p11 [label="mapPE"];
p12 [label="filter_reads"];
p11 -> p12;

p12 [label="filter_reads"];
p14 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
p12 -> p14 [label="filt_bams_ch"];

p12 [label="filter_reads"];
p13 [shape=point];
p12 -> p13;

p14 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
p15 [label="count_table"];
p14 -> p15;

p15 [label="count_table"];
p17 [label="filt_count_table"];
p15 -> p17;

p15 [label="count_table"];
p16 [shape=point];
p15 -> p16;

p17 [label="filt_count_table"];
p20 [shape=point];
p17 -> p20;

p17 [label="filt_count_table"];
p19 [shape=point];
p17 -> p19;

p17 [label="filt_count_table"];
p18 [shape=point];
p17 -> p18;

p21 [label="fastqc"];
p22 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
p21 -> p22 [label="multiqc_ch"];

p22 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
p23 [label="multiqc"];
p22 -> p23;

p23 [label="multiqc"];
p25 [shape=point];
p23 -> p25;

p23 [label="multiqc"];
p24 [shape=point];
p23 -> p24;

}
